#
# This is a Shiny web application. You can run the application by clicking
# the 'Run App' button above.
#
# Find out more about building applications with Shiny here:
#
#    http://shiny.rstudio.com/
#

library(shiny)
library(dplyr)
library(ggplot2)
#マッピングの際のテキスト用
library(ggrepel)
#デンドログラム
library(ggdendro)
# Define UI for application that draws a histogram
ui <- fluidPage(

    # Application title
    titlePanel("家計調査の可視化"),
    
    # Sidebar with a slider input for number of bins 
    sidebarLayout(
        sidebarPanel(
            
            selectInput("select1",label = "散布図のx軸を選んでください(1)",
                        choices =c("世帯人員", "食料合計", "穀類"                     
                                   , "米", "食パン", "他のパン"                     
                                   ,"生うどんそば", "乾うどんそば"                
                                   , "スパゲッティ", "中華麺"                       
                                   , "カップ麺", "即席麺", "他の麺類"                     
                                   , "小麦粉", "もち", "他の穀類のその他"             
                                   , "魚介類"  , "まぐろ" , "あじ"                         
                                   , "いわし" , "かつお", "かれい"                       
                                   , "さけ", "さば", "さんま"                       
                                   , "たい" , "ぶり", "いか"                         
                                   , "たこ", "えび" , "かに"                         
                                   , "他の鮮魚" , "さしみ盛合わせ"               
                                   , "あさり", "しじみ", "かき貝"                     
                                   , "ほたて貝", "他の貝" , "塩さけ"                       
                                   , "たらこ" , "しらす干し"                   
                                   , "干しあじ", "他の塩干魚介"                 
                                   , "揚げかまぼこ", "ちくわ"                       
                                   , "かまぼこ" , "他の魚肉練製品"               
                                   , "かつお節削り節" , "魚介の漬物"                   
                                   , "魚介のつくだ煮", "魚介の缶詰"                   
                                   , "他の魚介加工品のその他"       
                                   , "肉類", "牛肉", "豚肉"                         
                                   , "鶏肉" , "合いびき肉"                   
                                   , "他の生鮮肉" , "ハム", "ソーセージ"                   
                                   , "ベーコン"   , "他の加工肉"                   
                                   , "乳卵類", "牛乳" , "粉ミルク"                     
                                   , "ヨーグルト", "バター" , "チーズ"                       
                                   , "他の乳製品" , "卵", "野菜海藻"                
                                   , "キャベツ" , "ほうれんそう"                 
                                   , "はくさい", "ねぎ", "レタス"                       
                                   , "ブロッコリー", "もやし"  , "他の葉茎菜"                   
                                   , "さつまいも", "じゃがいも"                   
                                   , "さといも" , "だいこん" , "にんじん"                     
                                   , "ごぼう" , "たまねぎ"  , "れんこん"                     
                                   , "たけのこ" , "他の根菜", "さやまめ"                     
                                   , "かぼちゃ", "きゅうり" , "なす"                         
                                   , "トマト", "ピーマン", "生しいたけ"                   
                                   , "しめじ" , "えのきたけ"                   
                                   , "他のきのこ", "他の野菜のその他"             
                                   , "豆類" , "干ししいたけ"                 
                                   , "干しのり" , "わかめ" , "こんぶ"                       
                                   , "他の乾物海藻"   , "豆腐"                         
                                   ,"油揚げがんもどき" ,"納豆"                         
                                   ,"他の大豆製品"  ,"こんにゃく"                   
                                   ,"梅干し"                       
                                   ,"だいこん漬"  ,"はくさい漬"                   
                                   ,"他の野菜の漬物"  ,"こんぶつくだ煮"               
                                   ,"他の野菜海藻の佃煮"          
                                   ,"他の野菜海藻加工品のその他"  
                                   ,"果物" ,"りんご" ,"みかん"                       
                                   ,"グレープフルーツ" ,"オレンジ"                     
                                   ,"他の柑きつ類"  ,"梨" ,"ぶどう"                       
                                   ,"柿"    ,"桃"                           
                                   ,"すいか" ,"メロン"                       
                                   ,"いちご" ,"バナナ"  ,"キウイフルーツ"               
                                   ,"他の果物" ,"果物加工品" ,"油脂調味料"              
                                   ,"食用油","マーガリン" ,"食塩"                         
                                   ,"しょう油","みそ","砂糖","酢"                           
                                   ,"ソース" ,"ケチャップ"                   
                                   ,"マヨネーズマヨネーズ風調味料"
                                   ,"ドレッシング"   ,"ジャム"                       
                                   ,"カレールウ","乾燥スープ"                   
                                   ,"風味調味料"  ,"ふりかけ"                     
                                   ,"つゆたれ","他の調味料"                   
                                   ,"菓子類","ようかん"                     
                                   ,"まんじゅう" ,"他の和生菓子"                 
                                   ,"カステラ" , "ケーキ"                       
                                   , "ゼリー", "プリン"                       
                                   , "他の洋生菓子" , "せんべい"                     
                                   , "ビスケット", "スナック菓子"                 
                                   , "キャンデー" , "チョコレート"                 
                                   , "チョコレート菓子"             
                                   , "アイスクリームシャーベット"  
                                   , "他の菓子" , "調理食品"                 
                                   , "弁当", "すし弁当"                   
                                   , "おにぎりその他" , "調理パン"                     
                                   , "他の主食的調理食品", "うなぎのかば焼き"             
                                   , "サラダ", "コロッケ"                     
                                   , "カツレツ" , "天ぷらフライ"                
                                   , "しゅうまい" , "ぎょうざ"                     
                                   , "やきとり" , "ハンバーグ"                   
                                   , "冷凍調理食品", "そうざい材料セット"           
                                   , "他の調理食品のその他" , "飲料"                     
                                   ,"緑茶", "紅茶", "他の茶葉"                     
                                   , "茶飲料", "コーヒー"                     
                                   , "コーヒー飲料", "ココアココア飲料"            
                                   , "果実野菜ジュース" , "炭酸飲料"                     
                                   , "乳酸菌飲料" , "乳飲料"                       
                                   , "ミネラルウォーター" , "スポーツドリンク"             
                                   ,"他の飲料のその他","酒類" ,"清酒"                         
                                   ,"焼酎" ,"ビール" ,"ウイスキー"                   
                                   ,"ワイン"                       
                                   ,"発泡酒ビール風アルコール飲料"
                                   ,"チューハイカクテル"  ,"他の酒"                       
                                   ,"外食" ,"日本そばうどん"              
                                   ,"中華そば"   ,"他の麺類外食"                 
                                   ,"すし外食" ,"和食","中華食"                       
                                   ,"洋食" ,"焼肉","ハンバーガー"                 
                                   ,"他の主食的外食","喫茶代" ,"飲酒代"                       
                                   ,"学校給食") ),
            selectInput("select2",label = "散布図のy軸を選んでください(2)",
                        choices =c("世帯人員", "食料合計", "穀類"                     
                                   , "米", "食パン", "他のパン"                     
                                   ,"生うどんそば", "乾うどんそば"                
                                   , "スパゲッティ", "中華麺"                       
                                   , "カップ麺", "即席麺", "他の麺類"                     
                                   , "小麦粉", "もち", "他の穀類のその他"             
                                   , "魚介類"  , "まぐろ" , "あじ"                         
                                   , "いわし" , "かつお", "かれい"                       
                                   , "さけ", "さば", "さんま"                       
                                   , "たい" , "ぶり", "いか"                         
                                   , "たこ", "えび" , "かに"                         
                                   , "他の鮮魚" , "さしみ盛合わせ"               
                                   , "あさり", "しじみ", "かき貝"                     
                                   , "ほたて貝", "他の貝" , "塩さけ"                       
                                   , "たらこ" , "しらす干し"                   
                                   , "干しあじ", "他の塩干魚介"                 
                                   , "揚げかまぼこ", "ちくわ"                       
                                   , "かまぼこ" , "他の魚肉練製品"               
                                   , "かつお節削り節" , "魚介の漬物"                   
                                   , "魚介のつくだ煮", "魚介の缶詰"                   
                                   , "他の魚介加工品のその他"       
                                   , "肉類", "牛肉", "豚肉"                         
                                   , "鶏肉" , "合いびき肉"                   
                                   , "他の生鮮肉" , "ハム", "ソーセージ"                   
                                   , "ベーコン"   , "他の加工肉"                   
                                   , "乳卵類", "牛乳" , "粉ミルク"                     
                                   , "ヨーグルト", "バター" , "チーズ"                       
                                   , "他の乳製品" , "卵", "野菜海藻"                
                                   , "キャベツ" , "ほうれんそう"                 
                                   , "はくさい", "ねぎ", "レタス"                       
                                   , "ブロッコリー", "もやし"  , "他の葉茎菜"                   
                                   , "さつまいも", "じゃがいも"                   
                                   , "さといも" , "だいこん" , "にんじん"                     
                                   , "ごぼう" , "たまねぎ"  , "れんこん"                     
                                   , "たけのこ" , "他の根菜", "さやまめ"                     
                                   , "かぼちゃ", "きゅうり" , "なす"                         
                                   , "トマト", "ピーマン", "生しいたけ"                   
                                   , "しめじ" , "えのきたけ"                   
                                   , "他のきのこ", "他の野菜のその他"             
                                   , "豆類" , "干ししいたけ"                 
                                   , "干しのり" , "わかめ" , "こんぶ"                       
                                   , "他の乾物海藻"   , "豆腐"                         
                                   ,"油揚げがんもどき" ,"納豆"                         
                                   ,"他の大豆製品"  ,"こんにゃく"                   
                                   ,"梅干し"                       
                                   ,"だいこん漬"  ,"はくさい漬"                   
                                   ,"他の野菜の漬物"  ,"こんぶつくだ煮"               
                                   ,"他の野菜海藻の佃煮"          
                                   ,"他の野菜海藻加工品のその他"  
                                   ,"果物" ,"りんご" ,"みかん"                       
                                   ,"グレープフルーツ" ,"オレンジ"                     
                                   ,"他の柑きつ類"  ,"梨" ,"ぶどう"                       
                                   ,"柿"    ,"桃"                           
                                   ,"すいか" ,"メロン"                       
                                   ,"いちご" ,"バナナ"  ,"キウイフルーツ"               
                                   ,"他の果物" ,"果物加工品" ,"油脂調味料"              
                                   ,"食用油","マーガリン" ,"食塩"                         
                                   ,"しょう油","みそ","砂糖","酢"                           
                                   ,"ソース" ,"ケチャップ"                   
                                   ,"マヨネーズマヨネーズ風調味料"
                                   ,"ドレッシング"   ,"ジャム"                       
                                   ,"カレールウ","乾燥スープ"                   
                                   ,"風味調味料"  ,"ふりかけ"                     
                                   ,"つゆたれ","他の調味料"                   
                                   ,"菓子類","ようかん"                     
                                   ,"まんじゅう" ,"他の和生菓子"                 
                                   ,"カステラ" , "ケーキ"                       
                                   , "ゼリー", "プリン"                       
                                   , "他の洋生菓子" , "せんべい"                     
                                   , "ビスケット", "スナック菓子"                 
                                   , "キャンデー" , "チョコレート"                 
                                   , "チョコレート菓子"             
                                   , "アイスクリームシャーベット"  
                                   , "他の菓子" , "調理食品"                 
                                   , "弁当", "すし弁当"                   
                                   , "おにぎりその他" , "調理パン"                     
                                   , "他の主食的調理食品", "うなぎのかば焼き"             
                                   , "サラダ", "コロッケ"                     
                                   , "カツレツ" , "天ぷらフライ"                
                                   , "しゅうまい" , "ぎょうざ"                     
                                   , "やきとり" , "ハンバーグ"                   
                                   , "冷凍調理食品", "そうざい材料セット"           
                                   , "他の調理食品のその他" , "飲料"                     
                                   ,"緑茶", "紅茶", "他の茶葉"                     
                                   , "茶飲料", "コーヒー"                     
                                   , "コーヒー飲料", "ココアココア飲料"            
                                   , "果実野菜ジュース" , "炭酸飲料"                     
                                   , "乳酸菌飲料" , "乳飲料"                       
                                   , "ミネラルウォーター" , "スポーツドリンク"             
                                   ,"他の飲料のその他","酒類" ,"清酒"                         
                                   ,"焼酎" ,"ビール" ,"ウイスキー"                   
                                   ,"ワイン"                       
                                   ,"発泡酒ビール風アルコール飲料"
                                   ,"チューハイカクテル"  ,"他の酒"                       
                                   ,"外食" ,"日本そばうどん"              
                                   ,"中華そば"   ,"他の麺類外食"                 
                                   ,"すし外食" ,"和食","中華食"                       
                                   ,"洋食" ,"焼肉","ハンバーガー"                 
                                   ,"他の主食的外食","喫茶代" ,"飲酒代"                       
                                   ,"学校給食") ),
            selectInput("select3",label = "計量多次元尺度法またはクラスタリングで用いる変数を選んでください(3)",
                        choices =c("世帯人員", "食料合計", "穀類"                     
                                   , "米", "食パン", "他のパン"                     
                                   ,"生うどんそば", "乾うどんそば"                
                                   , "スパゲッティ", "中華麺"                       
                                   , "カップ麺", "即席麺", "他の麺類"                     
                                   , "小麦粉", "もち", "他の穀類のその他"             
                                   , "魚介類"  , "まぐろ" , "あじ"                         
                                   , "いわし" , "かつお", "かれい"                       
                                   , "さけ", "さば", "さんま"                       
                                   , "たい" , "ぶり", "いか"                         
                                   , "たこ", "えび" , "かに"                         
                                   , "他の鮮魚" , "さしみ盛合わせ"               
                                   , "あさり", "しじみ", "かき貝"                     
                                   , "ほたて貝", "他の貝" , "塩さけ"                       
                                   , "たらこ" , "しらす干し"                   
                                   , "干しあじ", "他の塩干魚介"                 
                                   , "揚げかまぼこ", "ちくわ"                       
                                   , "かまぼこ" , "他の魚肉練製品"               
                                   , "かつお節削り節" , "魚介の漬物"                   
                                   , "魚介のつくだ煮", "魚介の缶詰"                   
                                   , "他の魚介加工品のその他"       
                                   , "肉類", "牛肉", "豚肉"                         
                                   , "鶏肉" , "合いびき肉"                   
                                   , "他の生鮮肉" , "ハム", "ソーセージ"                   
                                   , "ベーコン"   , "他の加工肉"                   
                                   , "乳卵類", "牛乳" , "粉ミルク"                     
                                   , "ヨーグルト", "バター" , "チーズ"                       
                                   , "他の乳製品" , "卵", "野菜海藻"                
                                   , "キャベツ" , "ほうれんそう"                 
                                   , "はくさい", "ねぎ", "レタス"                       
                                   , "ブロッコリー", "もやし"  , "他の葉茎菜"                   
                                   , "さつまいも", "じゃがいも"                   
                                   , "さといも" , "だいこん" , "にんじん"                     
                                   , "ごぼう" , "たまねぎ"  , "れんこん"                     
                                   , "たけのこ" , "他の根菜", "さやまめ"                     
                                   , "かぼちゃ", "きゅうり" , "なす"                         
                                   , "トマト", "ピーマン", "生しいたけ"                   
                                   , "しめじ" , "えのきたけ"                   
                                   , "他のきのこ", "他の野菜のその他"             
                                   , "豆類" , "干ししいたけ"                 
                                   , "干しのり" , "わかめ" , "こんぶ"                       
                                   , "他の乾物海藻"   , "豆腐"                         
                                   ,"油揚げがんもどき" ,"納豆"                         
                                   ,"他の大豆製品"  ,"こんにゃく"                   
                                   ,"梅干し"                       
                                   ,"だいこん漬"  ,"はくさい漬"                   
                                   ,"他の野菜の漬物"  ,"こんぶつくだ煮"               
                                   ,"他の野菜海藻の佃煮"          
                                   ,"他の野菜海藻加工品のその他"  
                                   ,"果物" ,"りんご" ,"みかん"                       
                                   ,"グレープフルーツ" ,"オレンジ"                     
                                   ,"他の柑きつ類"  ,"梨" ,"ぶどう"                       
                                   ,"柿"    ,"桃"                           
                                   ,"すいか" ,"メロン"                       
                                   ,"いちご" ,"バナナ"  ,"キウイフルーツ"               
                                   ,"他の果物" ,"果物加工品" ,"油脂調味料"              
                                   ,"食用油","マーガリン" ,"食塩"                         
                                   ,"しょう油","みそ","砂糖","酢"                           
                                   ,"ソース" ,"ケチャップ"                   
                                   ,"マヨネーズマヨネーズ風調味料"
                                   ,"ドレッシング"   ,"ジャム"                       
                                   ,"カレールウ","乾燥スープ"                   
                                   ,"風味調味料"  ,"ふりかけ"                     
                                   ,"つゆたれ","他の調味料"                   
                                   ,"菓子類","ようかん"                     
                                   ,"まんじゅう" ,"他の和生菓子"                 
                                   ,"カステラ" , "ケーキ"                       
                                   , "ゼリー", "プリン"                       
                                   , "他の洋生菓子" , "せんべい"                     
                                   , "ビスケット", "スナック菓子"                 
                                   , "キャンデー" , "チョコレート"                 
                                   , "チョコレート菓子"             
                                   , "アイスクリームシャーベット"  
                                   , "他の菓子" , "調理食品"                 
                                   , "弁当", "すし弁当"                   
                                   , "おにぎりその他" , "調理パン"                     
                                   , "他の主食的調理食品", "うなぎのかば焼き"             
                                   , "サラダ", "コロッケ"                     
                                   , "カツレツ" , "天ぷらフライ"                
                                   , "しゅうまい" , "ぎょうざ"                     
                                   , "やきとり" , "ハンバーグ"                   
                                   , "冷凍調理食品", "そうざい材料セット"           
                                   , "他の調理食品のその他" , "飲料"                     
                                   ,"緑茶", "紅茶", "他の茶葉"                     
                                   , "茶飲料", "コーヒー"                     
                                   , "コーヒー飲料", "ココアココア飲料"            
                                   , "果実野菜ジュース" , "炭酸飲料"                     
                                   , "乳酸菌飲料" , "乳飲料"                       
                                   , "ミネラルウォーター" , "スポーツドリンク"             
                                   ,"他の飲料のその他","酒類" ,"清酒"                         
                                   ,"焼酎" ,"ビール" ,"ウイスキー"                   
                                   ,"ワイン"                       
                                   ,"発泡酒ビール風アルコール飲料"
                                   ,"チューハイカクテル"  ,"他の酒"                       
                                   ,"外食" ,"日本そばうどん"              
                                   ,"中華そば"   ,"他の麺類外食"                 
                                   ,"すし外食" ,"和食","中華食"                       
                                   ,"洋食" ,"焼肉","ハンバーガー"                 
                                   ,"他の主食的外食","喫茶代" ,"飲酒代"                       
                                   ,"学校給食") ,
                        multiple = T),
            sliderInput("sidebar4",
                        "クラスター数の変更(4)",
                        min = 1,
                        max = 10,
                        value = 4),
        
            radioButtons("button",
                         label = "グラフを選択してください",
                         choices = c("散布図(1)(2)" = "radio1",
                                     "計量多次元尺度法(3)" = "radio2",
                                     "階層的クラスタリングのデンドログラム(3)" = "radio3",
                                     "クラスターで色分けした計量多次元尺度法(3)(4)" = "radio4"
                                     )
                         ),
            h4("グラフの詳細設定"),
            sliderInput("sidebar1",
                        "目盛の文字サイズの変更",
                        min = 5,
                        max = 15,
                        value = 10),
            sliderInput("sidebar2",
                        "ラベルの文字サイズの変更",
                        min = 10,
                        max = 20,
                        value = 17),
            sliderInput("sidebar3",
                        "凡例の文字サイズの変更",
                        min = 1,
                        max = 10,
                        value = 6),
            
            sliderInput("sidebar5",
                        "凡例タイトルの文字サイズの変更",
                        min = 10,
                        max = 20,
                        value = 15),
            ),
        
        

        # Show a plot of the generated distribution
        mainPanel(
           plotOutput("Plot")
        )
    )
)

# Define server logic required to draw a histogram
server <- function(input, output) {
    #データ読み込み
    data<-read.csv("SSDSE-2020C.csv",skip = 1)
    #ラベルの名前変更
    names(data)<-c("地域コード", "都道府県","市区町村"                        
                   , "世帯人員", "食料合計", "穀類"                     
                   , "米", "食パン", "他のパン"                     
                   ,"生うどんそば", "乾うどんそば"                
                   , "スパゲッティ", "中華麺"                       
                   , "カップ麺", "即席麺", "他の麺類"                     
                   , "小麦粉", "もち", "他の穀類のその他"             
                   , "魚介類"  , "まぐろ" , "あじ"                         
                   , "いわし" , "かつお", "かれい"                       
                   , "さけ", "さば", "さんま"                       
                   , "たい" , "ぶり", "いか"                         
                   , "たこ", "えび" , "かに"                         
                   , "他の鮮魚" , "さしみ盛合わせ"               
                   , "あさり", "しじみ", "かき貝"                     
                   , "ほたて貝", "他の貝" , "塩さけ"                       
                   , "たらこ" , "しらす干し"                   
                   , "干しあじ", "他の塩干魚介"                 
                   , "揚げかまぼこ", "ちくわ"                       
                   , "かまぼこ" , "他の魚肉練製品"               
                   , "かつお節削り節" , "魚介の漬物"                   
                   , "魚介のつくだ煮", "魚介の缶詰"                   
                   , "他の魚介加工品のその他"       
                   , "肉類", "牛肉", "豚肉"                         
                   , "鶏肉" , "合いびき肉"                   
                   , "他の生鮮肉" , "ハム", "ソーセージ"                   
                   , "ベーコン"   , "他の加工肉"                   
                   , "乳卵類", "牛乳" , "粉ミルク"                     
                   , "ヨーグルト", "バター" , "チーズ"                       
                   , "他の乳製品" , "卵", "野菜海藻"                
                   , "キャベツ" , "ほうれんそう"                 
                   , "はくさい", "ねぎ", "レタス"                       
                   , "ブロッコリー", "もやし"  , "他の葉茎菜"                   
                   , "さつまいも", "じゃがいも"                   
                   , "さといも" , "だいこん" , "にんじん"                     
                   , "ごぼう" , "たまねぎ"  , "れんこん"                     
                   , "たけのこ" , "他の根菜", "さやまめ"                     
                   , "かぼちゃ", "きゅうり" , "なす"                         
                   , "トマト", "ピーマン", "生しいたけ"                   
                   , "しめじ" , "えのきたけ"                   
                   , "他のきのこ", "他の野菜のその他"             
                   , "豆類" , "干ししいたけ"                 
                   , "干しのり" , "わかめ" , "こんぶ"                       
                   , "他の乾物海藻"   , "豆腐"                         
                   ,"油揚げがんもどき" ,"納豆"                         
                   ,"他の大豆製品"  ,"こんにゃく"                   
                   ,"梅干し"                       
                   ,"だいこん漬"  ,"はくさい漬"                   
                   ,"他の野菜の漬物"  ,"こんぶつくだ煮"               
                   ,"他の野菜海藻の佃煮"          
                   ,"他の野菜海藻加工品のその他"  
                   ,"果物" ,"りんご" ,"みかん"                       
                   ,"グレープフルーツ" ,"オレンジ"                     
                   ,"他の柑きつ類"  ,"梨" ,"ぶどう"                       
                   ,"柿"    ,"桃"                           
                   ,"すいか" ,"メロン"                       
                   ,"いちご" ,"バナナ"  ,"キウイフルーツ"               
                   ,"他の果物" ,"果物加工品" ,"油脂調味料"              
                   ,"食用油","マーガリン" ,"食塩"                         
                   ,"しょう油","みそ","砂糖","酢"                           
                   ,"ソース" ,"ケチャップ"                   
                   ,"マヨネーズマヨネーズ風調味料"
                   ,"ドレッシング"   ,"ジャム"                       
                   ,"カレールウ","乾燥スープ"                   
                   ,"風味調味料"  ,"ふりかけ"                     
                   ,"つゆたれ","他の調味料"                   
                   ,"菓子類","ようかん"                     
                   ,"まんじゅう" ,"他の和生菓子"                 
                   ,"カステラ" , "ケーキ"                       
                   , "ゼリー", "プリン"                       
                   , "他の洋生菓子" , "せんべい"                     
                   , "ビスケット", "スナック菓子"                 
                   , "キャンデー" , "チョコレート"                 
                   , "チョコレート菓子"             
                   , "アイスクリームシャーベット"  
                   , "他の菓子" , "調理食品"                 
                   , "弁当", "すし弁当"                   
                   , "おにぎりその他" , "調理パン"                     
                   , "他の主食的調理食品", "うなぎのかば焼き"             
                   , "サラダ", "コロッケ"                     
                   , "カツレツ" , "天ぷらフライ"                
                   , "しゅうまい" , "ぎょうざ"                     
                   , "やきとり" , "ハンバーグ"                   
                   , "冷凍調理食品", "そうざい材料セット"           
                   , "他の調理食品のその他" , "飲料"                     
                   ,"緑茶", "紅茶", "他の茶葉"                     
                   , "茶飲料", "コーヒー"                     
                   , "コーヒー飲料", "ココアココア飲料"            
                   , "果実野菜ジュース" , "炭酸飲料"                     
                   , "乳酸菌飲料" , "乳飲料"                       
                   , "ミネラルウォーター" , "スポーツドリンク"             
                   ,"他の飲料のその他","酒類" ,"清酒"                         
                   ,"焼酎" ,"ビール" ,"ウイスキー"                   
                   ,"ワイン"                       
                   ,"発泡酒ビール風アルコール飲料"
                   ,"チューハイカクテル"  ,"他の酒"                       
                   ,"外食" ,"日本そばうどん"              
                   ,"中華そば"   ,"他の麺類外食"                 
                   ,"すし外食" ,"和食","中華食"                       
                   ,"洋食" ,"焼肉","ハンバーガー"                 
                   ,"他の主食的外食","喫茶代" ,"飲酒代"                       
                   ,"学校給食" )
   
    output$Plot <- renderPlot({
        switch(input$button,
            radio1 = {
            data%>%
            ggplot(aes_string(x=input$select1,y=input$select2))+
            geom_point()+
            geom_text_repel(label=data$市,
                            size=input$sidebar3)+
            labs(x=input$select1,y=input$select2)+
            theme(axis.text = element_text(
                size = input$sidebar1),
                axis.title = element_text(
                    size = input$sidebar2))
                   },
            radio2 = {
            #計量多次元尺度法
                data1<-
                    data%>%
                    select(input$select3)
                dist<-
                    dist(data1,method = "euclidean",diag = T,upper = T)
                mds.dist<-
                    cmdscale(dist,eig = T)
                data.frame(mds.dist$points)%>%
                    ggplot(aes(x=mds.dist$points[,1],
                               y=mds.dist$points[,2]))+
                    geom_point()+
                    geom_text_repel(label=data$市,
                                    size=input$sidebar3)+
                    labs(x="",y="")+
                    theme(axis.text = element_text(
                        size = input$sidebar1),
                        axis.title = element_text(
                            size = input$sidebar2))
               
            },
            radio3 = {
                #階層的クラスタリング
                #デンドログラム
                data1<-
                    data%>%
                    select(input$select3)
                rownames(data1)<-
                    data$市
                dist<-
                    dist(data1,method = "euclidean",diag = T,upper = T)
                hc.wd<-hclust(dist^2/2,method = "ward")
                ggdendrogram(hc.wd)+
                theme(axis.text = element_text(
                    size = input$sidebar1))
                
                
            },
            radio4 = {
                data1<-
                    data%>%
                    select(input$select3)
                dist<-
                    dist(data1,method = "euclidean",diag = T,upper = T)
                mds.dist<-
                    cmdscale(dist,eig = T)
                data2<-data.frame(mds.dist$points)
                data2<-
                    data2%>%
                    mutate(クラスター=as.factor(cutree(hc.wd,k=input$sidebar4)))
                data2%>%
                    ggplot(aes(x=X1,
                               y=X2,
                               colour=クラスター))+
                    geom_point()+
                    geom_text_repel(label=data$市,
                                    size=input$sidebar3)+
                    labs(x="",y="")+
                    theme(axis.text = element_text(
                        size = input$sidebar1),
                        axis.title = element_text(
                            size = input$sidebar2),
                        legend.position = "bottom",
                        legend.text = element_text(
                            size = input$sidebar5),
                        legend.title = element_text(
                            size = input$sidebar5)
                        )
            }
            )
            })
}

# Run the application 
shinyApp(ui = ui, server = server)
